Revit 2027 API
FormattedText.SetAllCapsStatus(Boolean) Method
 Sets the characters in the entire text to be in all caps or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAllCapsStatus(
	bool isAllCaps
)
Public Sub SetAllCapsStatus (
	isAllCaps As Boolean
)
public:
void SetAllCapsStatus(
	bool isAllCaps
)
member SetAllCapsStatus :
        isAllCaps : bool -> unit
Parameters
isAllCaps Boolean
 The desired all caps status of characters in the entire text. True to set all capped, false to set not all capped.
See Also
Reference
FormattedText Class
SetAllCapsStatus Overload
Autodesk.Revit.DB Namespace